[
  {
    "code": "s1",
    "text": "Ты просыпаешься перед компьютером, в комнате заставленной беспорядком. Неожидано для тебя - экран монитора черный, на нем одна за одной набираются строки зелёного цвета:</h2><h3>Wake up, Neo...<br>The Matrix has you...<br>Follow the white rabbit.</h3><h2>Ты пытаешься выйти из диалога - решительно и многократно нажимаешь Esc... Но ничего не происходит. Тебя начинает охватывать паника. На мониторе появляется следующее сообщение:</h2><h3>Knock, knock, Neo.</h3><h2>В твою дверь два раза сильно постучали.<br><br>Откроешь дверь?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s2"
      },
      {
        "answer": "No",
        "next": "s4.2"
      }
    ]
  },
  {
    "code": "s2",
    "text": "Открыв дверь ты видишь малознакомых тебе людей. Они пришли забрать дискету с программой, которую заказывали у тебя.<br>Дискета у них. Твои знакомые замечают, что ты выглядишь бледно и приглашают в клуб развеяться. Ты сначала отказываешься, но потом замечаешь у одной из пришедших татуировку белого кролика.<br><br>Пойдешь за белым кроликом?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s3"
      },
      {
        "answer": "No",
        "next": "s4.2"
      }
    ]
  },
  {
    "code": "s3",
    "text": "В ночном клубе ты держишься в стороне от танцующих масс в силу характера. К тебе подходит незнакомая девушка и называет тебя по имени. Представляется Тринити. Ты знаешь, что это имя известного хакера и догадываешься, что это она взломала твой компьютер этой ночью. Она говорит, что ты в опасности и нужно быть осторожным. Как и ты она видит странные закономерности в мире. И если ты хочешь получить ответ на свой вопрос: \"Что такое Матрица?\", то ответить на него сможет только один человек. После чего девушка растворилась в толпе.<br><br>Продолжишь отдыхать?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s4.1"
      },
      {
        "answer": "No",
        "next": "s4.2"
      }
    ]
  },
  {
    "code": "s4.1",
    "text": "*DING-DING-DING*<br>Ты просываешься от гормкого звука будильника, на часах 9:00. Ты проспал.<br><br>По твоему приходу на работу тебя вызвал к себе начальник, чтобы сделать выговор о постоянных опозданиях. В плохом настроении духа ты возвращаешься на рабочее место.<br><br>Через время к тебе подходит курьер и вручает конверт. Когда курьер скрылся за углом, ты открываешь конверт и достаешь из него мобильный телефон. Как только ты взял его в руку - телефон сразу же зазвонил.<br><br>Ответишь на звонок?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s5"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s4.2",
    "text": "Утро обычного, серого буднего дня. Проснувшись ты собрался и отправился на работу<br><br>На работе к тебе подходит курьер и вручает конверт. Когда курьер скрылся за углом, ты открываешь конверт и достаешь из него мобильный телефон. Как только ты взял его в руку - телефон сразу же зазвонил.<br><br>Ответишь на звонок?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s5"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s5",
    "text": "Человек представляется Морфиусом, говорит, что искал тебя и хочет рассказать тебе правду, если ты хочешь. Он предупреждает, что времени на размышления мало, так как за тобой пришли агенты. Если ты не хочешь, чтобы они тебя взяли - нужно следовать его инструкциям.<br><br>Довериться Морфиусу?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s6"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s6",
    "text": "Следуя советам Морфиуса, ты прячешься за столами, перебегаешь из одного офисного бокса в другой и вот ты добрался до изолированного от офисного пространства кабинета. За окном строительные леса. Единственный свободный выход из здания – пробраться по карнизу на леса, а по ним на крышу. Ты открываешь окно и перед тобой открывается вид с 20 этажа небоскрёба, в котором ты работаешь, тебя охватывает страх и захватывает дыхание.<br><br>Пойдешь дальше по карнизу к строительным лесам?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s7"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s7",
    "text": "Ты аккуратно переставляешь ноги по карнизу, прижимаясь к окну. Ветер так и норовит сбить твоё равновесие. Ты дошёл до элемента фасада, разделяющего оконные проёмы. Он выступает за карниз, не давая тебе пройти дальше. Ты осторожно выглядываешь из-за него и видишь перед собой строительные леса, осталось совсем немного, только обогнуть этот элемент. Ты смотришь вниз, вроде ты сможешь дотянуться до следующего карниза, если немного повиснуть на элементе.<br><br>В этот момент подул сильный ветер. Он выбивает телефон из твоей руки, и ты видишь, как долго он падает вниз. Эмоции охватывают тебя ещё сильнее.<br><br>Это всё же невозможно.",
    "variations": [
      {
        "answer": "Yes",
        "next": "s8.1"
      },
      {
        "answer": "No",
        "next": "s8.2"
      }
    ]
  },
  {
    "code": "s8.1",
    "text": "К тебе подошли люди в черном, похожие на государственных агентов и сопроводили на допрос. Один из агентов садиться напротив тебя, кидает на стол толстую папку и начинает её листать. По её содержанию ты понимаешь, что дело плохо и там информация о твоих киберпреступлениях. Они давно следили за тобой и обвиняют в хакерстве. Агент предлагает тебе сделку: твоё дело закрывается взамен на помощь в поимке Морфиуса, которого во многих странах считают опаснейшим террористом.<br><br>Согласен?",
    "variations": [
      {
        "answer": "Yes",
        "next": "sLose"
      },
      {
        "answer": "No",
        "next": "s9"
      }
    ]
  },
  {
    "code": "s8.2",
    "text": "Ты уверен? Это же самоубийство...",
    "variations": [
      {
        "answer": "Yes",
        "next": "s9.2"
      },
      {
        "answer": "No",
        "next": "s8.1"
      }
    ]
  },
  {
    "code": "s9.2",
    "text": "Собрав волю в кулак, ты обхватываешь этот элемент фасада руками и тянешься ногой к карнизу с другой стороны. Панели фасадного элементы, которые ты сжимаешь руками, чтобы не отправится в шестидесятиметровое, стремительное путешествие на встречу асфальту, начинают продавливаться, а руки понемногу дрожать. Ты вытянул ногу как только мог, но все равно не хватает до карниза совсем немного, была бы твоя стопа чуть длиннее, сантиметров на 10, можно было бы зацепиться. В момент глубокого отчаянья, алюминиевые фасадные панели под твоими ладонями все же продавливаются… На мгновение ты уже подумал, что падаешь, но это твои руки провалились во вмятины в панелях. Твоё сцепление стало надёжнее и это позволило тебе дотянуться до карниза.<br>Через окно ты видишь, что дверь в кабинет открывается, тебя могут увидеть.<br><br>Бежим к строительным лесам?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s10.2"
      },
      {
        "answer": "No",
        "next": "s8.1"
      }
    ]
  },
  {
    "code": "s10.2",
    "text": "Ты успел добежать до строительных лесов пока тебя никто не заметил.<br>Поднявшись по ним на крышу, ты нашел там спуск по лестнице. Выйдя из здания через черный ход, ты встретил Тринити на мотоцикле. Вместе вы уехали в безопасное место.<br>Она привезла тебя к заброшенному зданию и открыла входную дверь.<br><br>Войдешь за ней?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s14"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s9",
    "text": "Ты послал их куда подальше и попросил телефонный звонок. Агент закрыл папку, он разочарован. Он начинает тебе угрожать. Ты говоришь, что на тебя это не подействует и просишь телефон. Агент тебе отвечает:<h3>Зачем вам телефон, если сейчас вы не можете говорить? </h3><h2>Ты понимаешь, что у тебя нет рта. Ты вскакиваешь со стула и пятишься назад к стене, тебя охватила паника, не знаешь, что делать. Другие агенты в комнате подходят к тебе, ты не можешь сопротивляться, всё как во сне. Тебе в живот вживляют какого-то паразита. Пытаешься закричать, но не можешь. Сознание покидает тебя.<br><br>Продолжишь бороться?</h2>",
    "variations": [
      {
        "answer": "Yes",
        "next": "s10"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s10",
    "text": "Ты просыпаешься среди бардака от назойливого будильника. Голова ватная, тебе приснился очень странный сон. Через неплотно задернутые шторы пробивается солнечный свет, попадающий в твои не адаптировавшиеся глаза. Ещё одно утро, ещё одно опоздание в серый офис, на монотонную работу.<br>Вдруг зазвонил телефон.<br>Ответишь?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s11"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s11",
    "text": "Тебе позвонил Морфиус и сказал, что телефон прослушивают, но ты слишком важен для него, поэтому он рискнет. Он назначил тебе встречу вечером у моста.<br><br>Пойдешь?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s12"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s12",
    "text": "Ты стоишь ночью под мостом, на улице идёт ливень.<br>Ровно в назначенное время подъезжает машина и открывается задняя дверь. Сев в машину ты видишь Тринити рядом с собой. Водитель и девушка на пассажирском сидении рядом с ним тебе не знакомы.<br>Как только вы отъехали девушка резко разворачивается к тебе и угрожает пистолетом. Она говорит тебе делать всё так как они скажут или можешь прямо сейчас проваливать домой.<br><br>Может ну его эти сомнительные приключения?..",
    "variations": [
      {
        "answer": "Yes",
        "next": "sLose"
      },
      {
        "answer": "No",
        "next": "s13"
      }
    ]
  },
  {
    "code": "s13",
    "text": "Тринити достает какое-то странное большое устройство, и приставляет к твоему животу, пока девушка на переднем сидении держит тебя под прицелом пистолета. Тринити включает устройство, оно присасывается к твоему животу, из тебя что-то начинает вырываться наружу… Через секунду ты видишь, что это паразит, которого тебе вживили в твоём сне. Тринити выкидывает его из окна машины. Все успокоились, и вы спокойно едете дальше.<br>Они привезли тебя к заброшенному зданию и открыли входную дверь.<br><br>Войдешь за ними?",
    "variations": [
      {
        "answer": "Yes",
        "next": "s14"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s14",
    "text": "Войдя, ты видишь обветшавший интерьер. Обои на стенах либо отклеились, либо почернели, либо отсутствуют, местами разбившаяся плитка устилает пол, а мебель в коридор и комнатах является скорее препятствием или укрытием, нежели частью интерьера.<br>Пройдя по коридорам и поднявшись по лестнице, вы наконец-то заходите в просторное и более-менее обставленное помещение, у окна которого спиной к вам стоял мужчина. Он поприветствовал вас и представился Морфиусом. Для него эта встреча долгожданна, и он очень рад тебя видеть. Он спрашивает тебя:<br>- «Ты хочешь узнать, что такое Матрица?»",
    "variations": [
      {
        "answer": "Yes",
        "next": "s15"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "s15",
    "text": "- «Матрица повсюду, она окружает нас, даже сейчас она с нами рядом. Ты видишь её, когда смотришь в окно или включаешь телевизор. Ты ощущаешь её, когда работаешь, когда идешь в церковь, когда платишь налоги. Целый мирок, натянутый на глаза, чтобы спрятать правду. О том что все мы в темнице для разума.<br>Невозможно объяснить, что такое Матрица. Ты должен увидеть это сам – сказав это, Морфиус достает что-то из футляра. Он протягивает к тебе закрытые ладони и спрашивает – Ты можешь отказаться и принять синюю таблетку – в этот момент он раскрывает левую ладонь, на которой лежит синяя таблетка – тогда ты проснешься в своей постели и поверишь, что всё это был сон. Или ты можешь согласиться и принять красную таблетку – теперь он раскрывает левую ладонь – И я покажу тебе, как глубока кроличья нора.»<br>",
    "variations": [
      {
        "answer": "Yes",
        "next": "sWin"
      },
      {
        "answer": "No",
        "next": "sLose"
      }
    ]
  },
  {
    "code": "sLose",
    "text": "Ты просыпаешься среди бардака от назойливого будильника. Голова ватная, тебе приснился очень странный сон. Через неплотно задернутые шторы пробивается солнечный свет, попадающий в твои не адаптировавшиеся глаза. Ещё одно утро, ещё одно опоздание в серый офис, на монотонную работу.",
    "variations": [
      {
        "answer": "Yes",
        "next": "start"
      }
    ]
  },
  {
    "code": "sWin",
    "text": "Поздравляю, ты выбрался из Матрицы! Игра пройдена. Продолжение следует, возможно...",
    "variations": [
      {
        "answer": "Yes",
        "next": "finish"
      }
    ]
  }
]
